[Killed] BinaryExpression
www/tp-jest/src/interval.js:8:16
     }
 
     toString() {
-        return "[" + this.start + "," + this.end + "]";
+        return "[" + this.start + "," - this.end + "]";
     }
 

[Killed] BinaryExpression
www/tp-jest/src/interval.js:26:16
      * @returns {boolean}
      */
     overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
+        return this.end <= interval.start && this.start < interval.end;
     }
 

[Killed] Block
www/tp-jest/src/interval.js:45:24
      * @param {Interval} interval
      * @returns {boolean}
      */
-    includes(interval) {
-        return this.start < interval.start && this.start < interval.end && this.end > interval.start && this.end > interval.end
-    };
+    includes(interval) {};
 
     /**

[Killed] BinaryExpression
www/tp-jest/src/interval.js:46:16
      * @returns {boolean}
      */
     includes(interval) {
-        return this.start < interval.start && this.start < interval.end && this.end > interval.start && this.end > interval.end
+        return this.start < interval.start || this.start < interval.end && this.end > interval.start && this.end > interval.end
     };
 

[Killed] BinaryExpression
www/tp-jest/src/interval.js:46:16
      * @returns {boolean}
      */
     includes(interval) {
-        return this.start < interval.start && this.start < interval.end && this.end > interval.start && this.end > interval.end
+        return this.start <= interval.start && this.start < interval.end && this.end > interval.start && this.end > interval.end
     };
 

[Killed] Block
www/tp-jest/src/interval.js:65:21
      * @param {Interval} interval
      * @returns {Interval[]}
      */
-    union(interval) {
-        let res = [];
-        if(this.overlaps(interval)){
-            let startNewInterval = this.start < interval.start?this.start:interval.start;
-            let endNewInterval = this.end > interval.end?this.end:interval.end;
-            res.push(new Interval(startNewInterval,endNewInterval));
-        }else {
-            if(this.end < interval.start) {
-                res.push(this);
-                res.push(interval);
-            } else {
-                res.push(interval);
-                res.push(this);
-            }
-        }
-        return res;
-    };
+    union(interval) {};
 
     /**

[Killed] Block
www/tp-jest/src/interval.js:67:36
      */
     union(interval) {
         let res = [];
-        if(this.overlaps(interval)){
-            let startNewInterval = this.start < interval.start?this.start:interval.start;
-            let endNewInterval = this.end > interval.end?this.end:interval.end;
-            res.push(new Interval(startNewInterval,endNewInterval));
-        }else {
+        if(this.overlaps(interval)){}else {
             if(this.end < interval.start) {
                 res.push(this);

[Killed] IfStatement
www/tp-jest/src/interval.js:67:12
      */
     union(interval) {
         let res = [];
-        if(this.overlaps(interval)){
+        if(true){
             let startNewInterval = this.start < interval.start?this.start:interval.start;
             let endNewInterval = this.end > interval.end?this.end:interval.end;

[Killed] ConditionalExpression
www/tp-jest/src/interval.js:68:36
     union(interval) {
         let res = [];
         if(this.overlaps(interval)){
-            let startNewInterval = this.start < interval.start?this.start:interval.start;
+            let startNewInterval = false?this.start:interval.start;
             let endNewInterval = this.end > interval.end?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));

[Killed] BinaryExpression
www/tp-jest/src/interval.js:68:36
     union(interval) {
         let res = [];
         if(this.overlaps(interval)){
-            let startNewInterval = this.start < interval.start?this.start:interval.start;
+            let startNewInterval = this.start >= interval.start?this.start:interval.start;
             let endNewInterval = this.end > interval.end?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));

[Killed] ConditionalExpression
www/tp-jest/src/interval.js:69:34
         let res = [];
         if(this.overlaps(interval)){
             let startNewInterval = this.start < interval.start?this.start:interval.start;
-            let endNewInterval = this.end > interval.end?this.end:interval.end;
+            let endNewInterval = false?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));
         }else {

[Killed] BinaryExpression
www/tp-jest/src/interval.js:69:34
         let res = [];
         if(this.overlaps(interval)){
             let startNewInterval = this.start < interval.start?this.start:interval.start;
-            let endNewInterval = this.end > interval.end?this.end:interval.end;
+            let endNewInterval = this.end <= interval.end?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));
         }else {

[Killed] Block
www/tp-jest/src/interval.js:71:15
             let startNewInterval = this.start < interval.start?this.start:interval.start;
             let endNewInterval = this.end > interval.end?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));
-        }else {
-            if(this.end < interval.start) {
-                res.push(this);
-                res.push(interval);
-            } else {
-                res.push(interval);
-                res.push(this);
-            }
-        }
+        }else {}
         return res;
     };

[Killed] Block
www/tp-jest/src/interval.js:72:43
             let endNewInterval = this.end > interval.end?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));
         }else {
-            if(this.end < interval.start) {
-                res.push(this);
-                res.push(interval);
-            } else {
+            if(this.end < interval.start) {} else {
                 res.push(interval);
                 res.push(this);

[Killed] IfStatement
www/tp-jest/src/interval.js:72:16
             let endNewInterval = this.end > interval.end?this.end:interval.end;
             res.push(new Interval(startNewInterval,endNewInterval));
         }else {
-            if(this.end < interval.start) {
+            if(true) {
                 res.push(this);
                 res.push(interval);

[Killed] Block
www/tp-jest/src/interval.js:75:20
             if(this.end < interval.start) {
                 res.push(this);
                 res.push(interval);
-            } else {
-                res.push(interval);
-                res.push(this);
-            }
+            } else {}
         }
         return res;

[Killed] Block
www/tp-jest/src/interval.js:99:28
      * @param {Interval} interval
      * @returns {Interval|null}
      */
-    intersection(interval) {
-        if(typeof interval == "undefined"){
-            throw "Le paramètre interval est undefined";
-        }
-        if(interval.start>interval.end){
-            throw "Le paramètre interval n'est pas valide";
-        }
-
-        let res = [];
-        if(this.overlaps(interval)){
-            let startNewInterval = Math.max(this.start,interval.start);
-            let endNewINterval = Math.min(this.end, interval.end);
-            res.push(new Interval(startNewInterval,endNewINterval));
-        }
-        return res;
-    };
+    intersection(interval) {};
 
     /**

[Killed] IfStatement
www/tp-jest/src/interval.js:100:12
      * @returns {Interval|null}
      */
     intersection(interval) {
-        if(typeof interval == "undefined"){
+        if(false){
             throw "Le paramètre interval est undefined";
         }

[Killed] IfStatement
www/tp-jest/src/interval.js:100:12
      * @returns {Interval|null}
      */
     intersection(interval) {
-        if(typeof interval == "undefined"){
+        if(true){
             throw "Le paramètre interval est undefined";
         }

[Killed] Block
www/tp-jest/src/interval.js:103:40
         if(typeof interval == "undefined"){
             throw "Le paramètre interval est undefined";
         }
-        if(interval.start>interval.end){
-            throw "Le paramètre interval n'est pas valide";
-        }
+        if(interval.start>interval.end){}
 
         let res = [];

[Killed] IfStatement
www/tp-jest/src/interval.js:103:12
         if(typeof interval == "undefined"){
             throw "Le paramètre interval est undefined";
         }
-        if(interval.start>interval.end){
+        if(true){
             throw "Le paramètre interval n'est pas valide";
         }

[Killed] IfStatement
www/tp-jest/src/interval.js:108:12
         }
 
         let res = [];
-        if(this.overlaps(interval)){
+        if(false){
             let startNewInterval = Math.max(this.start,interval.start);
             let endNewINterval = Math.min(this.end, interval.end);

[Killed] Block
www/tp-jest/src/interval.js:108:36
         }
 
         let res = [];
-        if(this.overlaps(interval)){
-            let startNewInterval = Math.max(this.start,interval.start);
-            let endNewINterval = Math.min(this.end, interval.end);
-            res.push(new Interval(startNewInterval,endNewINterval));
-        }
+        if(this.overlaps(interval)){}
         return res;
     };

[Killed] IfStatement
www/tp-jest/src/interval.js:134:12
      */
     exclusion(interval) {
 
-        if(typeof interval == "undefined"){
+        if(false){
             throw "Le paramètre interval est undefined";
         }

[Killed] BinaryExpression
www/tp-jest/src/interval.js:134:12
      */
     exclusion(interval) {
 
-        if(typeof interval == "undefined"){
+        if(typeof interval != "undefined"){
             throw "Le paramètre interval est undefined";
         }

[Killed] StringLiteral
www/tp-jest/src/interval.js:135:19
     exclusion(interval) {
 
         if(typeof interval == "undefined"){
-            throw "Le paramètre interval est undefined";
+            throw "";
         }
         if(interval.start>interval.end){

[Killed] IfStatement
www/tp-jest/src/interval.js:137:12
         if(typeof interval == "undefined"){
             throw "Le paramètre interval est undefined";
         }
-        if(interval.start>interval.end){
+        if(false){
             throw "Le paramètre interval n'est pas valide";
         }

[Killed] Block
www/tp-jest/src/interval.js:142:38
         }
 
         let res = [];
-        if (this.includes(interval)) {
-            return res;
-        }
+        if (this.includes(interval)) {}
 
         if(!this.overlaps(interval)){

[Killed] IfStatement
www/tp-jest/src/interval.js:142:13
         }
 
         let res = [];
-        if (this.includes(interval)) {
+        if (false) {
             return res;
         }

[Killed] IfStatement
www/tp-jest/src/interval.js:146:12
             return res;
         }
 
-        if(!this.overlaps(interval)){
+        if(true){
             res.push(this);
             res.push(interval);

[Killed] IfStatement
www/tp-jest/src/interval.js:146:12
             return res;
         }
 
-        if(!this.overlaps(interval)){
+        if(false){
             res.push(this);
             res.push(interval);

[Killed] Block
www/tp-jest/src/interval.js:149:16
         if(!this.overlaps(interval)){
             res.push(this);
             res.push(interval);
-        } else {
-            let startNewInterval = Math.min(this.start,interval.start);
-            let endNewInterval = this.start===startNewInterval?interval.start:this.start;
-            res.push(new Interval(startNewInterval,endNewInterval));
-
-            startNewInterval = startNewInterval===this.start?this.end:interval.end;
-            endNewInterval = Math.max(this.end,interval.end);
-            res.push(new Interval(startNewInterval,endNewInterval));
-        }
+        } else {}
         return res;
     };

[Killed] ConditionalExpression
www/tp-jest/src/interval.js:151:34
             res.push(interval);
         } else {
             let startNewInterval = Math.min(this.start,interval.start);
-            let endNewInterval = this.start===startNewInterval?interval.start:this.start;
+            let endNewInterval = true?interval.start:this.start;
             res.push(new Interval(startNewInterval,endNewInterval));
 

[Killed] BinaryExpression
www/tp-jest/src/interval.js:151:34
             res.push(interval);
         } else {
             let startNewInterval = Math.min(this.start,interval.start);
-            let endNewInterval = this.start===startNewInterval?interval.start:this.start;
+            let endNewInterval = this.start !== startNewInterval?interval.start:this.start;
             res.push(new Interval(startNewInterval,endNewInterval));
 

[Killed] ConditionalExpression
www/tp-jest/src/interval.js:154:32
             let endNewInterval = this.start===startNewInterval?interval.start:this.start;
             res.push(new Interval(startNewInterval,endNewInterval));
 
-            startNewInterval = startNewInterval===this.start?this.end:interval.end;
+            startNewInterval = true?this.end:interval.end;
             endNewInterval = Math.max(this.end,interval.end);
             res.push(new Interval(startNewInterval,endNewInterval));

[Killed] ConditionalExpression
www/tp-jest/src/interval.js:154:32
             let endNewInterval = this.start===startNewInterval?interval.start:this.start;
             res.push(new Interval(startNewInterval,endNewInterval));
 
-            startNewInterval = startNewInterval===this.start?this.end:interval.end;
+            startNewInterval = false?this.end:interval.end;
             endNewInterval = Math.max(this.end,interval.end);
             res.push(new Interval(startNewInterval,endNewInterval));
