[Killed] IfStatement
www/tp-jest/src/math.js:7:9
         return 1;
     }
 
-    if (n >= 3000) {
+    if (true) {
         throw 'n too large'
     }

[Killed] Block
www/tp-jest/src/math.js:11:16
         throw 'n too large'
     }
 
-    if (n < 0) {
-        throw 'n is negative'
-    }
+    if (n < 0) {}
 
     return n * Util.factorial(n - 1);

[Killed] Block
www/tp-jest/src/math.js:26:29
  * @param {number} n
  * @returns {boolean}
  */
-Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
-        return false;
-    }
-    if (n < 0) {
-        throw 'Unable to compute prime for n < 0'
-    }
-    for (let i = 2; i < n; i++)
-        if (n % i === 0) return false;
-    return true;
-
-};
+Util.isPrime = function (n) {};
 
 

[Killed] BinaryExpression
www/tp-jest/src/math.js:27:9
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
+    if (n !== 1 || n === 0) {
         return false;
     }

[Killed] IfStatement
www/tp-jest/src/math.js:27:9
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
+    if (true) {
         return false;
     }

[Killed] IfStatement
www/tp-jest/src/math.js:30:9
     if (n === 1 || n === 0) {
         return false;
     }
-    if (n < 0) {
+    if (false) {
         throw 'Unable to compute prime for n < 0'
     }

[Killed] PostfixUnaryExpression
www/tp-jest/src/math.js:33:28
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'
     }
-    for (let i = 2; i < n; i++)
+    for (let i = 2; i < n; i--)
         if (n % i === 0) return false;
     return true;

[Killed] BinaryExpression
www/tp-jest/src/math.js:33:21
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'
     }
-    for (let i = 2; i < n; i++)
+    for (let i = 2; i >= n; i++)
         if (n % i === 0) return false;
     return true;

[Killed] BinaryExpression
www/tp-jest/src/math.js:34:13
         throw 'Unable to compute prime for n < 0'
     }
     for (let i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (n % i !== 0) return false;
     return true;
 

[Killed] BinaryExpression
www/tp-jest/src/math.js:34:13
         throw 'Unable to compute prime for n < 0'
     }
     for (let i = 2; i < n; i++)
-        if (n % i === 0) return false;
+        if (n * i === 0) return false;
     return true;
 

[Killed] Block
www/tp-jest/src/math.js:49:30
  * @param {number} n
  * @returns {number}
  */
-Util.sumPrime = function (n) {
-    if (n < 0) {
-        throw 'Unable to compute sumprime for n < 0'
-    }
-    let sum = 0;
-    for (let i = 0; i < n; i++) {
-        if (Util.isPrime(i)) {
-            sum += i;
-        }
-    }
-    return sum;
-};
+Util.sumPrime = function (n) {};
 
 /**

[Killed] BinaryExpression
www/tp-jest/src/math.js:50:9
  * @returns {number}
  */
 Util.sumPrime = function (n) {
-    if (n < 0) {
+    if (n >= 0) {
         throw 'Unable to compute sumprime for n < 0'
     }

[Killed] IfStatement
www/tp-jest/src/math.js:50:9
  * @returns {number}
  */
 Util.sumPrime = function (n) {
-    if (n < 0) {
+    if (false) {
         throw 'Unable to compute sumprime for n < 0'
     }

[Killed] PostfixUnaryExpression
www/tp-jest/src/math.js:54:28
         throw 'Unable to compute sumprime for n < 0'
     }
     let sum = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i < n; i--) {
         if (Util.isPrime(i)) {
             sum += i;

[Killed] ForStatement
www/tp-jest/src/math.js:54:21
         throw 'Unable to compute sumprime for n < 0'
     }
     let sum = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
         if (Util.isPrime(i)) {
             sum += i;

[Killed] IfStatement
www/tp-jest/src/math.js:55:13
     }
     let sum = 0;
     for (let i = 0; i < n; i++) {
-        if (Util.isPrime(i)) {
+        if (true) {
             sum += i;
         }

[Killed] IfStatement
www/tp-jest/src/math.js:55:13
     }
     let sum = 0;
     for (let i = 0; i < n; i++) {
-        if (Util.isPrime(i)) {
+        if (false) {
             sum += i;
         }

[Killed] Block
www/tp-jest/src/math.js:74:30
  * @param {number} n
  * @returns {array}
  */
-Util.fizzBuzz = function (n) {
-    if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
-    let result = [];
-    for (let i = 1; i <= n; i++) {
-        if ((i % 15) === 0) result.push("FizzBuzz");
-        else if ((i % 5) === 0) result.push("Buzz");
-        else if ((i % 3) === 0) result.push("Fizz");
-        else result.push(i);
-    }
-    return result;
-};
+Util.fizzBuzz = function (n) {};
 
 /**

[Killed] IfStatement
www/tp-jest/src/math.js:75:9
  * @returns {array}
  */
 Util.fizzBuzz = function (n) {
-    if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
+    if (true) throw "Le nombre ne respecte pas les données d'entres";
     let result = [];
     for (let i = 1; i <= n; i++) {

[Killed] BinaryExpression
www/tp-jest/src/math.js:75:9
  * @returns {array}
  */
 Util.fizzBuzz = function (n) {
-    if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
+    if (n < 0) throw "Le nombre ne respecte pas les données d'entres";
     let result = [];
     for (let i = 1; i <= n; i++) {

[Killed] BinaryExpression
www/tp-jest/src/math.js:77:21
 Util.fizzBuzz = function (n) {
     if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
     let result = [];
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i < n; i++) {
         if ((i % 15) === 0) result.push("FizzBuzz");
         else if ((i % 5) === 0) result.push("Buzz");

[Killed] BinaryExpression
www/tp-jest/src/math.js:77:21
 Util.fizzBuzz = function (n) {
     if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
     let result = [];
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i > n; i++) {
         if ((i % 15) === 0) result.push("FizzBuzz");
         else if ((i % 5) === 0) result.push("Buzz");

[Killed] BinaryExpression
www/tp-jest/src/math.js:78:13
     if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
     let result = [];
     for (let i = 1; i <= n; i++) {
-        if ((i % 15) === 0) result.push("FizzBuzz");
+        if (i % 15 !== 0) result.push("FizzBuzz");
         else if ((i % 5) === 0) result.push("Buzz");
         else if ((i % 3) === 0) result.push("Fizz");

[Killed] IfStatement
www/tp-jest/src/math.js:78:13
     if (n <= 0) throw "Le nombre ne respecte pas les données d'entres";
     let result = [];
     for (let i = 1; i <= n; i++) {
-        if ((i % 15) === 0) result.push("FizzBuzz");
+        if (false) result.push("FizzBuzz");
         else if ((i % 5) === 0) result.push("Buzz");
         else if ((i % 3) === 0) result.push("Fizz");

[Killed] IfStatement
www/tp-jest/src/math.js:79:18
     let result = [];
     for (let i = 1; i <= n; i++) {
         if ((i % 15) === 0) result.push("FizzBuzz");
-        else if ((i % 5) === 0) result.push("Buzz");
+        else if (true) result.push("Buzz");
         else if ((i % 3) === 0) result.push("Fizz");
         else result.push(i);

[Killed] IfStatement
www/tp-jest/src/math.js:79:18
     let result = [];
     for (let i = 1; i <= n; i++) {
         if ((i % 15) === 0) result.push("FizzBuzz");
-        else if ((i % 5) === 0) result.push("Buzz");
+        else if (false) result.push("Buzz");
         else if ((i % 3) === 0) result.push("Fizz");
         else result.push(i);

[Killed] BinaryExpression
www/tp-jest/src/math.js:80:18
     for (let i = 1; i <= n; i++) {
         if ((i % 15) === 0) result.push("FizzBuzz");
         else if ((i % 5) === 0) result.push("Buzz");
-        else if ((i % 3) === 0) result.push("Fizz");
+        else if (i % 3 !== 0) result.push("Fizz");
         else result.push(i);
     }

[Killed] IfStatement
www/tp-jest/src/math.js:80:18
     for (let i = 1; i <= n; i++) {
         if ((i % 15) === 0) result.push("FizzBuzz");
         else if ((i % 5) === 0) result.push("Buzz");
-        else if ((i % 3) === 0) result.push("Fizz");
+        else if (true) result.push("Fizz");
         else result.push(i);
     }

[Killed] Block
www/tp-jest/src/math.js:95:33
  * @param phrase
  * @returns {string}
  */
-Util.cipher = function (phrase) {
-    if (phrase.length === 0) throw "La chaine est vide";
-
-    if (/[1-9]/.test(phrase)) throw "Cette fonction ne gere pas les nombres";
-
-    let result = "";
-
-    for (let phraseElement of phrase) {
-        if (phraseElement === "Z") result += "A";
-        else if (phraseElement === "z") result += "a";
-        else if (phraseElement === " ") result += phraseElement;
-        else {
-            result += String.fromCharCode(phraseElement.charCodeAt(0) + 1);
-        }
-    }
-
-    return result;
-
-};
+Util.cipher = function (phrase) {};
 
 

[Killed] IfStatement
www/tp-jest/src/math.js:96:9
  * @returns {string}
  */
 Util.cipher = function (phrase) {
-    if (phrase.length === 0) throw "La chaine est vide";
+    if (false) throw "La chaine est vide";
 
     if (/[1-9]/.test(phrase)) throw "Cette fonction ne gere pas les nombres";

[Killed] IfStatement
www/tp-jest/src/math.js:96:9
  * @returns {string}
  */
 Util.cipher = function (phrase) {
-    if (phrase.length === 0) throw "La chaine est vide";
+    if (true) throw "La chaine est vide";
 
     if (/[1-9]/.test(phrase)) throw "Cette fonction ne gere pas les nombres";

[Killed] IfStatement
www/tp-jest/src/math.js:98:9
 Util.cipher = function (phrase) {
     if (phrase.length === 0) throw "La chaine est vide";
 
-    if (/[1-9]/.test(phrase)) throw "Cette fonction ne gere pas les nombres";
+    if (false) throw "Cette fonction ne gere pas les nombres";
 
     let result = "";

[Killed] IfStatement
www/tp-jest/src/math.js:98:9
 Util.cipher = function (phrase) {
     if (phrase.length === 0) throw "La chaine est vide";
 
-    if (/[1-9]/.test(phrase)) throw "Cette fonction ne gere pas les nombres";
+    if (true) throw "Cette fonction ne gere pas les nombres";
 
     let result = "";

[Killed] StringLiteral
www/tp-jest/src/math.js:100:18
 
     if (/[1-9]/.test(phrase)) throw "Cette fonction ne gere pas les nombres";
 
-    let result = "";
+    let result = "Stryker was here!";
 
     for (let phraseElement of phrase) {

[Killed] Block
www/tp-jest/src/math.js:102:39
 
     let result = "";
 
-    for (let phraseElement of phrase) {
-        if (phraseElement === "Z") result += "A";
-        else if (phraseElement === "z") result += "a";
-        else if (phraseElement === " ") result += phraseElement;
-        else {
-            result += String.fromCharCode(phraseElement.charCodeAt(0) + 1);
-        }
-    }
+    for (let phraseElement of phrase) {}
 
     return result;

[Killed] BinaryExpression
www/tp-jest/src/math.js:103:13
     let result = "";
 
     for (let phraseElement of phrase) {
-        if (phraseElement === "Z") result += "A";
+        if (phraseElement !== "Z") result += "A";
         else if (phraseElement === "z") result += "a";
         else if (phraseElement === " ") result += phraseElement;

[Killed] IfStatement
www/tp-jest/src/math.js:103:13
     let result = "";
 
     for (let phraseElement of phrase) {
-        if (phraseElement === "Z") result += "A";
+        if (false) result += "A";
         else if (phraseElement === "z") result += "a";
         else if (phraseElement === " ") result += phraseElement;

[Killed] BinaryExpression
www/tp-jest/src/math.js:104:18
 
     for (let phraseElement of phrase) {
         if (phraseElement === "Z") result += "A";
-        else if (phraseElement === "z") result += "a";
+        else if (phraseElement !== "z") result += "a";
         else if (phraseElement === " ") result += phraseElement;
         else {

[Killed] IfStatement
www/tp-jest/src/math.js:104:18
 
     for (let phraseElement of phrase) {
         if (phraseElement === "Z") result += "A";
-        else if (phraseElement === "z") result += "a";
+        else if (false) result += "a";
         else if (phraseElement === " ") result += phraseElement;
         else {

[Killed] IfStatement
www/tp-jest/src/math.js:105:18
     for (let phraseElement of phrase) {
         if (phraseElement === "Z") result += "A";
         else if (phraseElement === "z") result += "a";
-        else if (phraseElement === " ") result += phraseElement;
+        else if (false) result += phraseElement;
         else {
             result += String.fromCharCode(phraseElement.charCodeAt(0) + 1);

[Killed] IfStatement
www/tp-jest/src/math.js:105:18
     for (let phraseElement of phrase) {
         if (phraseElement === "Z") result += "A";
         else if (phraseElement === "z") result += "a";
-        else if (phraseElement === " ") result += phraseElement;
+        else if (true) result += phraseElement;
         else {
             result += String.fromCharCode(phraseElement.charCodeAt(0) + 1);

[Killed] Block
www/tp-jest/src/math.js:106:14
         if (phraseElement === "Z") result += "A";
         else if (phraseElement === "z") result += "a";
         else if (phraseElement === " ") result += phraseElement;
-        else {
-            result += String.fromCharCode(phraseElement.charCodeAt(0) + 1);
-        }
+        else {}
     }
 

[Killed] BinaryExpression
www/tp-jest/src/math.js:107:43
         else if (phraseElement === "z") result += "a";
         else if (phraseElement === " ") result += phraseElement;
         else {
-            result += String.fromCharCode(phraseElement.charCodeAt(0) + 1);
+            result += String.fromCharCode(phraseElement.charCodeAt(0) - 1);
         }
     }
